#+TITLE: December 8-21, 2018 (14 days)
#+AUTHOR: dgplug.org
#+EMAIL: users@lists.dgplug.org
#+PROPERTY: Effort_ALL 0 0:05 0:10 0:30 1:00 2:00 3:00 4:00
#+COLUMNS: %35ITEM %TASKID %OWNER %3PRIORITY %TODO %5ESTIMATED{+} %3ACTUAL{+}
* REPORTS
** SCRUM BOARD
#+BEGIN: block-update-board
#+END:
** DEVELOPER SUMMARY
#+BEGIN: block-update-summary
#+END:
** BURNDOWN CHART
#+BEGIN: block-update-graph
#+END:
** BURNDOWN LIST
#+PLOT: title:"Burndown" ind:1 deps:(3 4) set:"term dumb" set:"xtics scale 0.5" set:"ytics scale 0.5" file:"burndown.plt" set:"xrange [0:17]"
#+BEGIN: block-update-burndown
#+END:
** TASK LIST
#+BEGIN: columnview :hlines 2 :maxlevel 5 :id "TASKS"
#+END:
* TASKS
  :PROPERTIES:
  :ID:       TASKS
  :SPRINTLENGTH: 14
  :SPRINTSTART: <2018-12-08 Sat>
  :wpd-bhavin192: 1.35
  :wpd-nightwarrior-xxx: 3.0
  :wpd-sidntrivedi: 0.75
  :END:
** bhavin192
*** Learning Golang Chapter 8. Goroutines and Channels [0/6]
    :PROPERTIES:
    :ESTIMATED: 3.40
    :ACTUAL:
    :OWNER:    bhavin192
    :ID:       READ.1544292539
    :TASKID:   READ.1544292539
    :END:
    - [ ] 8.1 Goroutines (15m)
    - [ ] 8.2 Example: Concurrent Clock Server (25m)
    - [ ] 8.3 Example: Concurrent Echo Server (25m)
    - [ ] 8.4 Channels (45m)
    - [ ] 8.5 Looping in Parallel (50m)
    - [ ] 8.6 Example: Concurrent Web Crawler (45m)
*** Learning Golang Chapter 8 Exercises [0/3]
    :PROPERTIES:
    :ESTIMATED: 10.5
    :ACTUAL:
    :OWNER:    bhavin192
    :ID:       DEV.1544292696
    :TASKID:   DEV.1544292696
    :END:
    - [ ] 8.2 (8h)
    - [ ] 8.4 (30m)
    - [ ] 8.5 (2h)
** nightwarrior-xxx
*** TODO Fun with graph theory [5/7] 
    :PROPERTIES:
    :ESTIMATED: 21
    :ACTUAL:   
    :OWNER:    nightwarrior-xxx
    :ID:       READ.1542000533
    :TASKID:   READ.1542000533
    :END:
    :LOGBOOK:
    CLOCK: [2018-12-15 Sat 00:36]
    CLOCK: [2018-12-14 Fri 23:58]--[2018-12-15 Sat 00:29] =>  0:31
    CLOCK: [2018-12-14 Fri 22:51]--[2018-12-14 Fri 23:58] =>  1:07
    CLOCK: [2018-12-14 Fri 13:59]--[2018-12-14 Fri 14:37] =>  0:38
    CLOCK: [2018-12-14 Fri 13:18]--[2018-12-14 Fri 13:59] =>  0:41
    CLOCK: [2018-12-13 Thu 21:01]--[2018-12-13 Thu 21:28] =>  0:27
    CLOCK: [2018-12-13 Thu 20:16]--[2018-12-13 Thu 20:19] =>  0:03
    CLOCK: [2018-12-13 Thu 19:48]--[2018-12-13 Thu 19:58] =>  0:10
    CLOCK: [2018-12-09 Sun 08:21]--[2018-12-09 Sun 08:44] =>  0:23
    CLOCK: [2018-12-09 Sun 05:40]--[2018-12-09 Sun 07:20] =>  1:40
    :END:
    [[https://www.hackerearth.com/practice/algorithms/graphs/graph-representation/practice-problems/]]
    https://www.spoj.com/problems/tag/graph-theory
    - [X] Flight Problem                                           (3h)
    - [X] Permutation Problem                                      (3h)
    - [X] Cycle Problem with weighted Graph and non weighted Graph (3h)
    - [X] Shortest Path Problem                                    (3h)
    - [X] Flyod-Warshall Algorithm                                 (3h)
    - [ ] Dijkstras Algorithm                                      (3h)
    - [ ] Minimum Spanning Tree Problem                            (3h)
*** TODO Learning Cryptography [/]
    :PROPERTIES:
    :ESTIMATED: 10
    :ACTUAL:
    :OWNER: nightwarrior-xxx
    :ID: READ.1542000612
    :TASKID: READ.1542000612
    :END:
    [[https://cryptopals.com/]]
    - [ ] Convert hex to base64       (1h)
    - [ ] Fixed XOR                   (1h)
    - [ ] Single-byte XOR cipher      (1h)
    - [ ] Detect single-character XOR (1h)
    - [ ] Implement repeating-key XOR (1h)
    - [ ] Break repeating-key XOR     (1h)
    - [ ] AES in ECB mode             (2h)
    - [ ] Detect AES in ECB mode      (2h)
*** TODO Playing with Trees [/]
    :PROPERTIES:
    :ESTIMATED: 6
    :ACTUAL:
    :OWNER: nightwarrior-xxx
    :ID: READ.1544250971
    :TASKID: READ.1544250971
    :END:
    - [ ] B Trees                    (1.5h)
    - [ ] B+ Trees                   (1.5h)
    - [ ] AVL Trees                  (1.5h)
    - [ ] Binary Trees               (1.5h)
*** DONE Build a hash table [2/2]
    :PROPERTIES:
    :ESTIMATED: 6
    :ACTUAL:
    :OWNER: nightwarrior-xxx
    :ID: READ.1544251043
    :TASKID: READ.1544251043
    :END:
    :LOGBOOK:
    CLOCK: [2018-12-08 Sat 17:52]--[2018-12-08 Sat 18:19] =>  0:27
    CLOCK: [2018-12-08 Sat 15:51]--[2018-12-08 Sat 16:41] =>  0:50
    CLOCK: [2018-12-08 Sat 15:03]--[2018-12-08 Sat 15:51] =>  0:48
    CLOCK: [2018-12-08 Sat 13:24]--[2018-12-08 Sat 13:31] =>  0:07
    :END:
    https://www.hackerearth.com/practice/data-structures/hash-tables/basics-of-hash-tables/tutorial/
    - [X] Chaining                    (3h)
    - [X] Open Addressing             (3h)

** sidntrivedi
*** IN_PROGRESS Freecodecamp Javascript Algorithms and Data Structures [1/3]
    :PROPERTIES:
    :ESTIMATED: 2.5
    :ACTUAL:   2.63
    :OWNER:    sidntrivedi012
    :ID:       DEV.1538995712
    :TASKID:   DEV.1538995712
    :END:
    :LOGBOOK:
    CLOCK: [2018-12-08 Sat 17:20]--[2018-12-08 Sat 18:07] =>  0:47
    CLOCK: [2018-12-08 Sat 16:35]--[2018-12-08 Sat 17:05] =>  0:30
    CLOCK: [2018-12-08 Sat 15:09]--[2018-12-08 Sat 15:59] =>  0:50
    CLOCK: [2018-12-08 Sat 12:58]--[2018-12-08 Sat 13:29] =>  0:31
    :END:
    - [X] Basic Javascript
    - [ ] ES6
    - [ ] REGULAR EXPRESSIONS
*** TODO [#A] Linux for you and me [0/1]
    :PROPERTIES:
    :ESTIMATED: 4
    :ACTUAL:
    :OWNER: sidntrivedi012
    :ID: READ.1538996950
    :TASKID: READ.1538996950
    :END:
    - [ ] File System
*** TODO [#A] [[https://www.hackerearth.com/practice/codemonk/][HackerEarth Codemonk Series]] [0/1]
    :PROPERTIES:
    :ESTIMATED: 4
    :ACTUAL:
    :OWNER: sidntrivedi012
    :ID: READ.1539000246
    :TASKID: READ.1539000246
    :END:
    - [ ] Standard Template Library

